// Code128.h: interface for the CCode128 class.
//
//////////////////////////////////////////////////////////////////////

#if !defined(AFX_CODE128_H__D7615FF7_3CC5_4C34_9ED9_9DE74CD95558__INCLUDED_)
#define AFX_CODE128_H__D7615FF7_3CC5_4C34_9ED9_9DE74CD95558__INCLUDED_

#if _MSC_VER > 1000
#pragma once
#endif // _MSC_VER > 1000

//Code128±àÂë
static char *code128set[] = {
    "212222", "222122", "222221", "121223", "121322",  /*  0 -  4 */
    "131222", "122213", "122312", "132212", "221213",
    "221312", "231212", "112232", "122132", "122231",  /* 10 - 14 */
    "113222", "123122", "123221", "223211", "221132",
    "221231", "213212", "223112", "312131", "311222",  /* 20 - 24 */
    "321122", "321221", "312212", "322112", "322211",
    "212123", "212321", "232121", "111323", "131123",  /* 30 - 34 */
    "131321", "112313", "132113", "132311", "211313",
    "231113", "231311", "112133", "112331", "132131",  /* 40 - 44 */
    "113123", "113321", "133121", "313121", "211331",
    "231131", "213113", "213311", "213131", "311123",  /* 50 - 54 */
    "311321", "331121", "312113", "312311", "332111",
    "314111", "221411", "431111", "111224", "111422",  /* 60 - 64 */
    "121124", "121421", "141122", "141221", "112214",
    "112412", "122114", "122411", "142112", "142211",  /* 70 - 74 */
    "241211", "221114", "413111", "241112", "134111",
    "111242", "121142", "121241", "114212", "124112",  /* 80 - 84 */
    "124211", "411212", "421112", "421211", "212141",
    "214121", "412121", "111143", "111341", "131141",  /* 90 - 94 */
    "114113", "114311", "411113", "411311", "113141",
    "114131", "311141", "411131", "211412", "211214",  /* 100 - 104 */
    "211232", "2331112"
};

#define START_A 103
#define START_B 104
#define START_C 105
#define STOP    106
#define SHIFT    98 /* only A and B */
#define CODE_A  101 /* only B and C */
#define CODE_B  100 /* only A and C */
#define CODE_C   99 /* only A and B */
#define FUNC_1  102 /* all of them */
#define FUNC_2   97 /* only A and B */
#define FUNC_3   96 /* only A and B */
/* FUNC_4 is CODE_A when in A and CODE_B when in B */

class CCode128  
{
public:
	int Code128AEncode(LPSTR text, LPSTR partial);
	int Code128AVerify(LPCSTR text);
	int Code128CEncode(LPSTR text, LPSTR partial);
	int Code128CVerify(LPCSTR text);
	int Code128BEncode(LPSTR text,LPSTR partial);
	int Code128BVerify(LPCSTR text);
	CCode128();
	virtual ~CCode128();

};

#endif // !defined(AFX_CODE128_H__D7615FF7_3CC5_4C34_9ED9_9DE74CD95558__INCLUDED_)
